Repository: fathineos/gt-workshop
Catalog: src/gt/locale/*/LC_MESSAGES/django.po
Languages: el

source: Service description
el: Περιγραφή

source: Remarks
el: Παρατηρήσεις

source: Travel distance in kilometers
el: Χιλιόμετρα

source: Service cost
el: Κόστος

source: Service creation date
el: Ημερομηνία σέρβις

source: Entry creation date
el: Ημερομηνία εγγραφής

source: Service
el: Σέρβις

source: Services
el: Σέρβις

source: American English
el: Αγγλικά (us)

source: Greek
el: Ελληνικά

source: Cliente
el: Αρχείο Σέρβις

source: Vehicle plate number
el: Πινακίδα

source: Vehicle manufacturer
el: Κατασκευαστής

source: Vehicle color
el: Χρώμα

source: Vehicle identification number
el: Αριθμός πλαισίου

source: Engine number
el: Αριθμός μηχανής

source: Construction year
el: Έτος κατασκευής

source: Purchage date
el: Ημερομηνία αγοράς

source: Vehicle
el: Όχημα

source: Vehicles
el: Οχήματα

source: Full name
el: Ονοματεπώνυμο

source: Address
el: Διεύθυνση

source: Primary phone
el: Τηλέφωνο

source: Secondary phone
el: Τηλέφωνο 2

source: Vehicle owner
el: Πελάτης

source: Vehicle owners
el: Πελάτες

source: Vehicle ownership
el: Ιδιοκτήτης

source: Vehicle ownerships
el: Ιδιοκτήτες
